Revit 2027 API
RevitAPIPreEventArgs.Cancel Method
 When the event is cancellable, may call the Cancel() method to cancel it.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Cancel()
Public Sub Cancel
public:
void Cancel()
member Cancel : unit -> unit
Remarks
 Not every event is cancellable. Whether or not an event may be cancelled is indicated by IsCancellable() method.
See Also
Reference
RevitAPIPreEventArgs Class
Autodesk.Revit.DB.Events Namespace